{"data":{"markdownRemark":{"html":"<p><img src=\"https://images.unsplash.com/photo-1508522109214-4df07c2e9d90\"></p>\n<p>So, I am going to talk about a really interesting topic i.e <strong>Redux Thunk.</strong> So first, if you are a beginner in redux and want to learn what does actually redux thunk is and why should you use it and by the end of the article you have a good understanding of <strong>Redux Thunk</strong>. So, before moving directly to <strong>redux thunk</strong> let’s just first talk about <strong>Action Creator</strong> in Redux.</p>\n<h2><strong>What is Action Creator?</strong></h2>\n<p>So, In Redux <strong>action</strong> is some kind of event that is triggered on a specific situation. Suppose, the user clicks a button then the user just want to perform some action. So, As you know that according to the paradigm of redux whenever you want to perform some action then you have to dispatch that action. And when you are dispatching that action you can send any kind of data with it. So, action creator is a simple function that takes data and dispatch inside itself. And you can import that action creator and map dispatch function to props using connect higher-order component from <strong>react-redux</strong> package. Then all you need is that just handle that event and call that action creator from props and pass the specified data into it. So, that means action creator only need that data you want to send when going to do everything for you.\nNow, let’s just talk about what is <strong>Redux Thunk</strong>.</p>\n<h2>What is Redux Thunk?</h2>\n<p>So, as I mentioned <strong>redux thunk</strong> is just an action creator with some extra power that helps us to deal with asynchronous calls. So, before you want to use <strong>redux thunk</strong> you have to know what is it actually. <strong>Redux Thunk</strong> is a middleware (middleware is some kind of code that runs b/w two main phases of <strong>redux paradigm</strong> i.e dispatching an action and taking that action to the reducer) that has a functionality of pausing and resuming the dispatch action. So, what is actually does when we dispatch an action creator it just takes data and perform some async call for that time until it gets the <strong>response</strong> it’s pause the dispatching of that action there and if it gets the <strong>response</strong> and then it going to resuming that dispatching that action and then goes to <strong>reducer</strong>.</p>\n<h2><strong>How to use a Redux Thunk?</strong></h2>\n<p>So, if you want to use the <strong>redux thunk</strong> then you have to install a <strong>redux-thunk **package and import **thunk</strong> from it.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">*import* thunk *from* &quot;redux-thunk&quot;;</code></pre></div>\n<p>Now you got the redux thunk. Now you have to import <strong>applyMiddlware, **and</strong> compose <strong>from **redux</strong> package.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">*import* { createStore, applyMiddleware, compose } *from* &#39;redux&#39;;</code></pre></div>\n<p>Now you have that. So, go to that file where you created your store and pass <strong>compose</strong> as the second parameter besides the <strong>rootReducer</strong> and inside that call <strong>applyMiddlware</strong> and pass <strong>thunk</strong> inside it.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">const store = createStore(rootReducer,   compose(applyMiddleware(thunk)));</code></pre></div>\n<p>So, now you just add thunk to your project and you can create your own <strong>thunk</strong> now. I am here making a simple thunk that helps you to make just a better understanding of <strong>thunk</strong>.\nSo, suppose you want an app where you just gave a Github username and it will give you the whole data when you submit a form.\nSo, let’s just make a simple thunk i.e a function called **setUserData **that takes the only username when the user is submitting a form.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">const setUserData = (username) =&gt; {\n  return (dispatch) =&gt; {\n    fetch(`https://api.github.com/users/${username}`)\n      .then(response =&gt; response.json())\n      .then(data =&gt; {\n         dispatch({type : &quot;SET_USER_DATA&quot;, userData : data});\n      }).catch(error =&gt; {\n         dispatch({type : &quot;SET_USER_ERR&quot;, error : error});\n     })\n    }\n}</code></pre></div>\n<p>So, we just make <strong>thunk</strong> so what it does it takes a username and fetch the <strong>userData</strong> and when it has the response it just resuming the dispatching of action.\nNow, I made this thunk, how can I use this.\nSo, All you need is just you have to import the <strong>thunk</strong> in the component you want to send the data.\nSo, for that, you have to import <strong>connect *<em>higher-order component</em> form **react-redux.</strong></p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">import {connect} from &#39;react-redux&#39;;\nimport setUserData from &#39;./thunk&#39;;</code></pre></div>\n<p>Then you have to call it like you want to use store in the component to change the view and you have to make a function that map **dispatch **into props.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">function mapDispatchToProps(dispatch) {\n   return {\n    setUserData : (username) =&gt; dispatch(setUserData(username));\n   }\n}\n\nexport default connect(null, mapDispatchToProps)(Form);</code></pre></div>\n<p>So, now all you need is just call the **setUserData **function from props when you are going to handle that event.\nYou can do like this.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">handleSubmit = (e) =&gt; {\n   const userName = this.state.username;\n   this.props.setUserData(userName);\n}</code></pre></div>\n<p>So, this all we need to apply a <strong>Redux Thunk</strong>.</p>\n<h2>Benefits of Using Redux Thunk</h2>\n<p>So, normally an <strong>action creator</strong> is returning an object but in case of <strong>thunk</strong> it returns and function where you can do some asynchronous work and when that work is done then from that function you can return the object by calling dispatch method. **Thunk **is a middleware that means you can perform anything before the action is going to the reducer but it’s ideal for asynchronous work.</p>\n<p>Follow me on <a href=\"https://twitter/am_prav_veen\">twitter</a>.\nFollow me on <a href=\"https://github.com/praveen-me\">Github</a>.</p>","frontmatter":{"title":"Redux Thunk: A Simple Action Creator Nothing More"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/redux-thunk-a-simple-action-creator-nothing-more/"}}